app/controllers/home_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "pdf"], ["created_at", "2018-10-14 05:24:16.648494"], ["updated_at", "2018-10-14 05:24:16.648494"]]
INSERT INTO "savings" ("system_id", "target", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["system_id", 10], ["target", 200000], ["created_at", "2018-10-14 13:42:09.508493"], ["updated_at", "2018-10-14 13:42:09.508493"]]
---
  def create
    @user = User.new(name:params[:name])
    @user.save
    @saving = Saving.new(target: 200000, system_id: @user.id)
    @saving.save