app/controllers/logs_controller.rb

  def show
    @log = Log.find_by(user_id: params[:user_id])
---
SELECT  "logs".* FROM "logs" WHERE "logs"."user_id" = ? LIMIT ?  [["user_id", "e165764"], ["LIMIT", 1]]

  def create
    @log = Log.new(log_params)

    respond_to do |format|
      if @log.save
---
INSERT INTO "logs" ("user_id", "date", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "e165764"], ["date", "2018-10-06 14:08:00"], ["amount", 100], ["created_at", "2018-10-06 14:08:27.337075"], ["updated_at", "2018-10-06 14:08:27.337075"]]

    def set_log
      @log = Log.find_by(user_id: params[:user_id])
---
SELECT  "logs".* FROM "logs" WHERE "logs"."user_id" = ? LIMIT ?  [["user_id", "e165764"], ["LIMIT", 1]]