app/controllers/savings_controller.rb

SELECT "savings".* FROM "savings"
---
  def index
    @savings = Saving.all

SELECT  "savings".* FROM "savings" WHERE "savings"."user_id" = ? LIMIT ?  [["user_id", "e165764"], ["LIMIT", 1]]
---
  def show
    @saving = Saving.find_by(user_id: params[:user_id])

INSERT INTO "savings" ("user_id", "target", "current", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "e165764"], ["target", 5000000000000000], ["current", 100], ["created_at", "2018-10-06 13:57:41.735914"], ["updated_at", "2018-10-06 13:57:41.735914"]]
---
  def create
    @saving = Saving.new(saving_params)

    respond_to do |format|
      if @saving.save

SELECT  "savings".* FROM "savings" WHERE "savings"."user_id" = ? LIMIT ?  [["user_id", "e165764"], ["LIMIT", 1]]
---
    def set_saving
      @saving = Saving.find_by(user_id: params[:user_id])