app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "users"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(user_id: params[:user_id])

INSERT INTO "users" ("user_id", "name", "email", "pass", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", "e165764"], ["name", "nomutaku"], ["email", "e165764@ie.u-ryukyu.ac.jp"], ["pass", "qwerty"], ["created_at", "2018-10-05 15:23:53.451086"], ["updated_at", "2018-10-05 15:23:53.451086"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."" IS NULL  [["name", "satou"], ["updated_at", "2018-10-05 15:11:46.429300"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."" IS NULL
---
  def destroy
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "users"], ["LIMIT", 1]]
---
    def set_user
      @user = User.find_by(user_id: params[:user_id])